schemas/src/main/resources/schemas/v3/interactions/RegisterMedicalCertificateInteraction/RegisterMedicalCertificateInteraction_3.0_rivtabp20.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. The ASF licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->
<wsdl:definitions 
	name="RegisterMedicalCertificateInteraction"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" 
	xmlns:xs="http://www.w3.org/2001/XMLSchema" 
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
	xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" 
	xmlns:wsa="http://www.w3.org/2005/08/addressing" 
	xmlns:tjs="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:3" 
	xmlns:tns="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificate:3:rivtabp20"
	targetNamespace="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificate:3:rivtabp20">

	<xs:annotation>
		<xs:documentation>
			Tjänsteinteraktionens namn: RegisterMedicalCertificateInteraction
			Beskrivning: 
				Interaction to register a new medical certificate.
			Revisioner: 
				2009-12-04 Version 1.0, Mats Ekhammar - Callista Enterprise AB
				2010-06-18 Version 2.0, Mats Ekhammar - Callista Enterprise AB
				2010-11-18 Version 3.0, Mats Ekhammar - Callista Enterprise AB
			Tjänstedomän: insuranceprocess:healthreporting
			Tjänsteinteraktionstyp: Fråga-svar
			RIV Teknisk Anvisning: Basic Profile 2.0
			Förvaltas av: xxx
		</xs:documentation>
	</xs:annotation>

	<wsdl:types>
		<xs:schema>
			<xs:import schemaLocation="RegisterMedicalCertificateResponder_3.0.xsd" namespace="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:3"/>
		</xs:schema>
		<xs:schema>
			<xs:import schemaLocation="../../core_components/ws-addressing-1.0.xsd" namespace="http://www.w3.org/2005/08/addressing"/>
		</xs:schema>
	</wsdl:types>

	<wsdl:message name="RegisterMedicalCertificateRequest">
		<xs:annotation>
			<xs:documentation>
				LogicalAddress is the organization id for Försäkringskassan.
			</xs:documentation>
		</xs:annotation>
		<wsdl:part name="LogicalAddress" element="wsa:To" />
		<wsdl:part name="parameters" element="tjs:RegisterMedicalCertificate" />
	</wsdl:message>

	<wsdl:message name="RegisterMedicalCertificateResponse">
		<wsdl:part name="parameters" element="tjs:RegisterMedicalCertificateResponse"/>
	</wsdl:message>

	<wsdl:portType name="RegisterMedicalCertificateResponderInterface">
	
		<wsdl:operation name="RegisterMedicalCertificate">
			<wsdl:input message="tns:RegisterMedicalCertificateRequest"/>
			<wsdl:output message="tns:RegisterMedicalCertificateResponse"/>
		</wsdl:operation>
		
	</wsdl:portType>
	
	<wsdl:binding name="RegisterMedicalCertificateResponderBinding" type="tns:RegisterMedicalCertificateResponderInterface">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

		<wsdl:operation name="RegisterMedicalCertificate">
			<soap:operation soapAction="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:1"/>
			<wsdl:input>
				<soap:header use="literal" message="tns:RegisterMedicalCertificateRequest" part="LogicalAddress"/>
				<soap:body use="literal" parts="parameters"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>

	</wsdl:binding>

	<wsdl:service name="RegisterMedicalCertificateResponderService">
		<wsdl:port name="RegisterMedicalCertificateResponderPort" binding="tns:RegisterMedicalCertificateResponderBinding">
			<soap:address location="http://tempuri.org"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
