web/src/test/resources/integrationtests/registermedicalcertificate/requests.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:3" xmlns:urn1="urn:riv:insuranceprocess:healthreporting:mu7263:3" xmlns:urn2="urn:riv:insuranceprocess:healthreporting:2">
   <soapenv:Header>
      <add:To>fk</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:RegisterMedicalCertificate>
         <urn:lakarutlatande>
            <urn1:lakarutlatande-id>$data.intygsId$</urn1:lakarutlatande-id>
            <urn1:typAvUtlatande>Läkarintyg enligt 3 kap, 8 § lagen (1962:381) om allmän försäkring</urn1:typAvUtlatande>
            <!--Optional:-->
            <urn1:kommentar>kommenterar</urn1:kommentar>
            <urn1:signeringsdatum>2016-06-22</urn1:signeringsdatum>
            <urn1:skickatDatum>2016-06-22</urn1:skickatDatum>
            <urn1:atgard>2016-06-22</urn1:atgard>
            <urn1:patient>
               <urn2:person-id root="1.2.752.129.2.1.3.1" extension="$data.personId$"/>
               <!--Optional:-->
               <urn2:fullstandigtNamn>Tolvan Tolvansson</urn2:fullstandigtNamn>
               <!--You may enter ANY elements at this point-->
            </urn1:patient>
            <urn1:skapadAvHosPersonal>
               <urn2:personal-id root="1.2.752.129.2.1.4.1" extension="Personal HSA-ID"/>
               <!--Optional:-->
               <urn2:fullstandigtNamn>Abra Kadabra</urn2:fullstandigtNamn>
               <!--Optional:-->
               <urn2:forskrivarkod>1234567</urn2:forskrivarkod>
               <urn2:enhet>
                  <urn2:enhets-id  root="1.2.752.129.2.1.4.1" extension="EnhetsId"/>
                  <!--Optional:-->
                  <urn2:arbetsplatskod  root="1.2.752.29.4.71" extension="123456789011"/>
                  <urn2:enhetsnamn>Kir Mott</urn2:enhetsnamn>
                  <!--Optional:-->
                  <urn2:postadress>gatan 1</urn2:postadress>
                  <!--Optional:-->
                  <urn2:postnummer>12345</urn2:postnummer>
                  <!--Optional:-->
                  <urn2:postort>Postboda</urn2:postort>
                  <!--Optional:-->
                  <urn2:telefonnummer>015053524</urn2:telefonnummer>
                  <!--Optional:-->
                  <urn2:epost>abc@gmail.com</urn2:epost>
                  <!--Optional:-->
                  <urn2:vardgivare>
                     <urn2:vardgivare-id root="1.2.752.129.2.1.4.1" extension="Vardgivarid"/>
                     <urn2:vardgivarnamn>Landstinget Norrland</urn2:vardgivarnamn>
                     <!--You may enter ANY elements at this point-->
                  </urn2:vardgivare>
                  <!--You may enter ANY elements at this point-->
               </urn2:enhet>
               <!--You may enter ANY elements at this point-->
            </urn1:skapadAvHosPersonal>
            <!--Zero or more repetitions:-->
            <urn1:vardkontakt>
               <urn1:vardkontakttyp>Min_telefonkontakt_med_patienten</urn1:vardkontakttyp>
               <urn1:vardkontaktstid>2013-03-10</urn1:vardkontaktstid>
               <!--You may enter ANY elements at this point-->
            </urn1:vardkontakt>
            <!--0 to 2 repetitions:-->
            <urn1:referens>
               <urn1:referenstyp>Journaluppgifter</urn1:referenstyp>
               <!--Optional:-->
               <urn1:datum>2013-03-10</urn1:datum>
               <!--You may enter ANY elements at this point-->
            </urn1:referens>
            <!--Zero or more repetitions:-->
            <urn1:aktivitet>
               <urn1:aktivitetskod>Ovrigt</urn1:aktivitetskod>
               <!--Optional:-->
               <urn1:beskrivning>När skadan förbättrats rekommenderas muskeluppbyggande sjukgymnastik</urn1:beskrivning>
               <!--You may enter ANY elements at this point-->
            </urn1:aktivitet>
            <urn1:aktivitet>
               <urn1:aktivitetskod>Planerad_eller_pagaende_behandling_eller_atgard_inom_sjukvarden</urn1:aktivitetskod>
               <!--Optional:-->
               <urn1:beskrivning>När skadan förbättrats rekommenderas muskeluppbyggande sjukgymnastik</urn1:beskrivning>
               <!--You may enter ANY elements at this point-->
            </urn1:aktivitet>
            <urn1:aktivitet>
               <urn1:aktivitetskod>Planerad_eller_pagaende_annan_atgard</urn1:aktivitetskod>
               <!--Optional:-->
               <urn1:beskrivning>När skadan förbättrats rekommenderas muskeluppbyggande sjukgymnastik</urn1:beskrivning>
               <!--You may enter ANY elements at this point-->
            </urn1:aktivitet>
            <!--Optional:-->
            <urn1:bedomtTillstand>
               <!--Optional:-->
               <urn1:beskrivning>Patienten klämde höger överarm vid olycka i hemmet. Problemen har pågått en längre tid.</urn1:beskrivning>
               <!--You may enter ANY elements at this point-->
            </urn1:bedomtTillstand>
            <urn1:medicinsktTillstand>
               <urn1:beskrivning>Klämskada på överarm</urn1:beskrivning>
               <urn1:tillstandskod codeSystemName="ICD-10" code="S47"/>
            </urn1:medicinsktTillstand>
            <!--Optional:-->
            <!--0 to 2 repetitions:-->
            <urn1:funktionstillstand>
               <!--Optional:-->
               <urn1:beskrivning>Kraftigt nedsatt rörlighet i överarmen pga skadan</urn1:beskrivning>
               <urn1:typAvFunktionstillstand>Aktivitet</urn1:typAvFunktionstillstand>
               <!--Optional:-->
               <urn1:arbetsformaga>
                  <!--Optional:-->
                  <urn1:motivering>Skadan har förvärrats vid varje tillfälle patienten använt armen.</urn1:motivering>
                  <!--Optional:-->
                  <urn1:prognosangivelse>Det_gar_inte_att_bedomma</urn1:prognosangivelse>
                  <!--Optional:-->
                  <urn1:arbetsuppgift>
                     <urn1:typAvArbetsuppgift>Dirigent
            Dirigerar en för större orkester på deltid</urn1:typAvArbetsuppgift>
                     <!--You may enter ANY elements at this point-->
                  </urn1:arbetsuppgift>
                  <!--1 to 4 repetitions:-->
                  <urn1:arbetsformagaNedsattning>
                     <urn1:varaktighetFrom>2013-03-17</urn1:varaktighetFrom>
                     <urn1:varaktighetTom>2013-04-15</urn1:varaktighetTom>
                     <urn1:nedsattningsgrad>Nedsatt_med_1/4</urn1:nedsattningsgrad>
                     <!--You may enter ANY elements at this point-->
                  </urn1:arbetsformagaNedsattning>
                  <!--0 to 3 repetitions:-->
                  <urn1:sysselsattning>
                     <urn1:typAvSysselsattning>Nuvarande_arbete</urn1:typAvSysselsattning>
                     <!--You may enter ANY elements at this point-->
                  </urn1:sysselsattning>
                  <!--You may enter ANY elements at this point-->
               </urn1:arbetsformaga>
               <!--You may enter ANY elements at this point-->
            </urn1:funktionstillstand>
            <urn1:funktionstillstand>
               <urn1:beskrivning>Kraftigt nedsatt rörlighet i överarmen pga skadan. Böj- och sträckförmågan är mycket dålig.
                                Smärtar vid rörelse vilket ger att patienten inte kan använda armen särkilt mycket.
               </urn1:beskrivning>
               <urn1:typAvFunktionstillstand>Kroppsfunktion</urn1:typAvFunktionstillstand>
               </urn1:funktionstillstand>
            
            <!--You may enter ANY elements at this point-->
         </urn:lakarutlatande>
         <!--You may enter ANY elements at this point-->
      </urn:RegisterMedicalCertificate>
   </soapenv:Body>
</soapenv:Envelope>
>>
